<!DOCTYPE html>
<html lang='uk'>
<head>
  <meta charset='utf-8'/>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <title>Oster.Te.Ua</title>
  <!--link rel='stylesheet' type='text/css' href='/default/css/styles.css' /-->
  <!--link rel='stylesheet' type='text/css' href='/default/css/desktop.css' /-->
  <script type='text/javascript' src='/default/js/optima/optima.js' defer></script>
  <script type='text/javascript' src='/default/js/optima/loader.js' defer></script>
  <script type='text/javascript' src='/default/js/optima/static.js' defer></script>
  <script type='text/javascript' src='/default/js/oster.js' defer></script>
<head>

<body style='opacity: 0'>
  <header>
    <panel class='page'>
      <currency>
        <icon class='icon16 money'></icon><a href='#'>Валюта: грн</a>
      </currency>
     
      <links>
        <icon class='icon16 user'></icon><a href='#'>Особистий кабінет</a>
        <icon class='icon16 favorite'></icon><a href='#'>Закладки (0)</a>
        <icon class='icon16 cart'></icon><a href='#'>Кошик</a>
        <icon class='icon16 order'></icon><a href='#'>Оформлення замовлення</a>
      </links>
    </panel>
  </header>
  
  <top class='page'>
    
    <logo>
      <img src='/default/img/logo.png' title='Компьютерний магазин «Остер», м. Тернопіль'/>
      <title class='s'>комп'ютерний магазин</title>
      <address>м. Тернопіль, вул. Руська, 41</address>
    </logo>
    
    <info>
      <button class='cart pointer'>0 товар(ів) - 0,00 грн.</button>
      <input type='text' class='search' value='' placeholder='Пошук'></input><button class='search pointer'></button>
    </info>
    
  </top>
  
  <border class='page menu'></border>
  <menu class='page'>
    <a href='#'>Головна</a>
    <a href='#'>Товари</a>
    <a href='#'>Послуги</a>
    <a href='#'>Доставка і оплата</a>
    <a href='#'>Обслуговування підприємств</a>
    <a href='#'>Блог</a>
    <a href='#'>Контакти</a>
  </menu>
  
  <page class='page'>

    <nav>
      <phones>
        <phone>096-70-07-444</phone>
        <phone>066-219-77-22</phone>
      </phones>
      <line></line>

      <times>
        <open>понеділок - п'ятниця:</open>
        <time>9:00 - 18:00</time>
        <open>субота:</open>
        <time>10:00 - 15:00</time>
        <close>неділя: вихідний</close>
      </times>

      <title>Каталог</title>
      <catalog>
        <a href='#'>Аксесуари для ноутбуків</a>
        <a href='#'>Кабелі та перехідники</a>
        <a href='#'>Комп`ютери, ноутбуки</a>
        <a href='#'>Комплектуючі</a>
        <a href='#'>Мережеве обладнання</a>
        <a href='#'>Носії інформації</a>
        <a href='#'>Периферія, аксесуари</a>
        <a href='#'>Планшети та аксесуари</a>
        <a href='#'>Різне</a>
        <a href='#'>Розхідні матеріали для друку</a>
        <a href='#'>Серверне обладнання</a>
        <a href='#'>Торгове обладнання</a>
        <a href='#'>Чистячі засоби</a>
      </catalog>

      <title>Послуги</title>
      <catalog>
      <a href='#'>Ремонт комп'ютерів</a>
        <a href='#'>Ремонт ноутбуків</a>
        <a href='#'>Встановлення, відновлення операційної системи Window, LINUX</a>
        <a href='#'>Збір системного блока комп'ютера за критеріями клієнта</a>
        <a href='#'>Чистка ноутбука чи комп'ютера</a>
        <a href='#'>Заправка картриджів</a>
        <a href='#'>Вічний картридж</a>
        <a href='#'>Ремонт принтерів</a>
        <a href='#'>Віддалений системний адміністратор</a>
        <a href='#'>Налаштування віддаленого робочого місця</a>
        <a href='#'>1С - cупровід і консультації</a>
        <a href='#'>Налаштування обладнання МікроТік</a>
      </catalog>

      <title class='m'>Ми у соціальних мережах:</title>
      <social class='end'>
        <a href='#' class='facebook'></a>
        <a href='#' class='instagram'></a>
        <a href='#' class='telegram'></a>
      </social>
      
    </nav>
    
    <content>
      
      <banner class='alert'>
        <text>НАГАДУВАННЯ!</text>
        <text>Під час повітряної тривоги комп'ютерний магазин «Остер»</text>
        <text>НЕ ПРАЦЮЄ!</text>
      </banner>
      
      <p>Ціни і наявність товарів уточняйте в менеджерів комп'ютерного магазину "ОСТЕР" Тернопіль, Руська, 41, або за телефоном: 0967007444.</p>
      <p>Після оформлення замовлення на сайті з Вами обов'язково зв'яжеться наш менеджер для уточнення всіх деталей</p>
      
      <title>Наші товари</title>
      <a class='category' href='#'>
        <logo class='goods'></logo>
        <name>Каталог товарів магазину Остер</name>
        <info>У нас Ви можете купити: ноутбуки, комп'ютери, планшети; навушники і колонки;  флешки і карти пам'яті, павер-банки й інші аксесуари; комплектуючі для комп'ютерів і ноутбуків.</info>
      </a>
      
      <title>Наші послуги</title>
      <services>
        <a class='category' href='#'>
          <logo class='autsorsing'></logo>
          <name>Обслуговування підприємств </name>
          <info>Сервісне обслуговування абонентів. Обслуговування серверів. Ремонт комп'ютерної техніки та ін.</info>
        </a>
        <a class='category' href='#'>
          <logo class='assembly'></logo>
          <name>Збір та апгрейд комп'ютера</name>
          <info>Збір та апгрейд системних блоків комп'ютерів відповідно до побажань клієнта.</info>
        </a>
        <a class='category' href='#'>
          <logo class='service-computer'></logo>
          <name>Ремонт комп'ютера</name>
          <info>Тестування, ремонт, заміна комплектуючих системного блока, апгрейд (модернізація) комп'ютера, відновлення інформації.</info>
        </a>
        <a class='category' href='#'>
          <logo class='service-notebook'></logo>
          <name>Ремонт ноутбука</name>
          <info>Заміна клавіатури, заміна матриці, ремонт або заміна частин корпусу ноутбука; ребол або заміна північного і південного мостів, чіпа відеокарти, процесора ноутбука.</info>
        </a>
        <a class='category' href='#'>
          <logo class='os'></logo>
          <name>Встановлення Windows, LINUX</name>
          <info>Встановлення, відновлення операційних систем Windows (віндовс), LINUX (лінукс) на ноутбук чи комп'ютер.</info>
        </a>
        <a class='category' href='#'>
          <logo class='clean-notebook'></logo>
          <name>Чистка ноутбуків і комп'ютерів</name>
          <info>Очистка ноутбука чи комп'ютера від пилу, заміна термопрокладки, заміна термопасти.</info>
        </a>
        <a class='category' href='#'>
          <logo class='service-printer'></logo>
          <name>Ремонт принтера</name>
          <info>Ремонт лазерних принтерів, ремонт струменевих принтерів, ремонт і заміна запчастин принтера.</info>
        </a>
        <a class='category' href='#'>
          <logo class='refill-cartridge'></logo>
          <name>Заправка і відновлення картриджів</name>
          <info>Заправка і відновлення лазерних і струменевих картриджів Canon, HP, Samsung.</info>
        </a>
        <a class='category' href='#'>
          <logo class='change-cartridge'></logo>
          <name>Обмін картриджів або Вічний картридж</name>
          <info>Надаємо послуги із заправки, відновлення і обміну лазерних картриджів</info>
        </a>
        <a class='category' href='#'>
          <logo class='mikrotik'></logo>
          <name>Налаштування обладнання MikroTik </name>
          <info>Професійне налаштування обладнання MikroTik: маршрутизатор, роутер, комутатор, світч. Налаштування DNS сервера. Налаштування мережі.</info>
        </a>
        <a class='category' href='#'>
          <logo class='remote'></logo>
          <name>Віддалене робоче місце</name>
          <info>Налаштування віддаленого робочого місця за допомогою роутера. Працюйте з дому!</info>
        </a>
        <a class='category' href='#'>
          <logo class='sysadmin'></logo>
          <name>Віддалений системний адміністратор</name>
          <info>Обслуговування фірм та офісів з комп'ютерами. Низькі ціни та висока якість обслуговування.</info>
        </a>
        <a class='category' href='#'>
          <logo class='c1'></logo>
          <name>1С - cупровід і консультації </name>
          <info>Наша компанія пропонує доступні ціни на послуги 1С:Підприємство, високий рівень кваліфікації фахівців, індивідуальний підхід до кожного клієнта і оперативність при виконанні поставлених завдань.</info>
        </a>
      </services>
      
      <block>
        <title>Купити комп'ютер, ноутбук, планшет</title>
        <p>Хочете купити комп'ютер, ноутбук, планшет, принтер, колонки, навушники чи іншу комп'ютерну техніку? Оберіть свій гаджет у магазині "Остер" Тернопіль. У нас демократичні ціни, знижки постійним клієнтам, гарантія на всі товари. Є можливість придбання товарів під замовлення.</p>
        <p>Потрібен комп'ютер для роботи чи для ігор? Ми підберемо або зберемо персональй комп'ютер (ПК) саме під ваші потреби.</p>
      </block>
      
      <block>
        <title>Ремонт комп'ютерів, ноутбуків у Тернополі</title>
        <p>Не працює ПК, ноутбук, планшет, смартфон?  Сервіс Остер готовий прийти на допомогу.</p>
        <p>Гріється, вимикається, зависає комп'ютер чи ноутбук? Проведемо діагностику, профілактику систем охолодження (очистка від пилу, заміна термопасти і термопрокладок), відремонтуємо.</p>
        <p>Портібна заміна комплектуючих? Серед наших послуг: заміна клавіатури ноутбука, заміна матриці ноутбука; заміна (встановлення) оперативної пам'яті, вінчестера, процесора, чи іншого компонента комп'ютера і ноутбука.</p>
      </block>
      
      <block>
        <title>Ремонт принтерів, заправка картриджів</title>
        <p>Не друкує чи друкує неякісно принтер? Майстри сервісу Остер допоможуть вирішити проблему світлого друку, застрягання паперу у принтері, сторонніх звуків при друці, чорних смуг на папері та інші. Серед послуг сервісу: заправка лазерного картриджа, заправка струменевого картриджа, відновлення лазерних і стуменевих картриджів, Вічний картридж, ремонт принтера, встановлення СБПЧ.</p>
        <p>Отже... Потрібен ремонт принтера чи заправка картриджа у Тернополі? Не зволікай - в  "ОСТЕР" швидше завітай!</p>
      </block>
      
      <block>
        <title>Обслуговування підприємств</title>
        <p>Забезпечимо стабільну роботу комп'ютерної техніки на підприємствах та в організаціях:
          <list class='italic'>
            <item>Обслуговування серверів</item>
            <item>Обслуговування та підтримка локальної мережі підприємства</item>
            <item>Обслуговування робочих станцій.</item>
          </list>
          <a href='#' class='more'>докладніше >></a>
        </p>
      </block>
      
      <block>
        <title>Налаштування віддаленого робочого місця</title>
        <p>В сучасному світі дедалі частіше виникає потреба працювати віддалено. Це досить зручно - комп'ютер стоїть в офісі, а ти працюєш за ним перебуваючи вдома за своїм ноутбуком (чи домашнім комп'ютером).</p>
        <p>Цікаво? Якщо є потреба у схожих налаштуваннях, ми з радістю вам допоможемо.  Детальніше про налаштування віддаленого робочого місця читайте тут: Налаштування віддаленого робочого місця.</p>
        <p>З такими можливостями жоден карантин та жодна непередбачувана ситуація не страшна.</p>
      </block>
      
      <social>
        <text>Підписуйтесь і будьте в курсі новинок! Ми в соціальних мережах:</text>
        <a href='#' class='facebook'></a>
        <a href='#' class='instagram'></a>
        <a href='#' class='telegram'></a>
      </social>
      
      <blog>
        <article>
          <name><a href='#'>Сервер резервних копій Raspberry NAS</a></name>
          <blogname>додано до: <a href='#'>Операційна система Linux</a></blogname>
          <text>
            <img src='/default/img/blog/rasp-nas.png' />
            Щоденне автоматичне інкрементальне резервне копіювання важливих бухгалтерських файлів.Бекап (backup) 1С7, 1С8, Медок, Мої документи.На сьогоднішній день процедура резервного копіювання даних є необхідною для безпечного функціонування компанії.Резервне копіювання дозволяє відновити дані у разі апаратних проблем, чи шифрування файлів криптовірусом.&n..
          </text>
          <right><a href='#' class='more'>докладніше >></a></right>
        </article>
        
        <article>
          <name><a href='#'>ТОП 10 проблем із ноутбуком чи комп'ютером</a></name>
          <blogname>додано до: <a href='#'>Ремонт ноутбуків "ОСТЕР" Тернопіль</a></blogname>
          <text>
            <img src='/default/img/blog/top10troubles.png' />
            Незважаючи на велику різноманітність виробників та моделей ноутбуків і комп'ютерів, як показує практика, "болячки" у них схожі. Найчастіше у комп'ютерні сервісні центри потрапляють ноутбуки і комп'ютери із наступними "симптомами": 1. Ноутбук не вмикається і індикатори не світяться.2. Індикатори на ноутбуці працюють, але зображення нема.3. Н..
          </text>
          <right><a href='#' class='more'>докладніше >></a></right>
        </article>
        
        <article>
          <name><a href='#'>Ноутбуки під замовлення</a></name>
          <blogname>додано до: <a href='#'>Огляди, товари, пропозиції</a></blogname>
          <text>
            <img src='/default/img/blog/notebook-order.png' />
            Потрібен ноутбук? В даний час ноутбуки привозимо під замовлення. Повідомте менеджеру нашого магазину інформацію про бажаний ноутбук. Це може бути:- модель ноутбука, який зацікавив, - характеристики, яким має відповідати ноутбук,- для яких робіт ноутбук використовуватиметься (спілкування онлайн, перегляд фільмів, робота з графікою, ігри...)&nbs..
          </text>
          <right><a href='#' class='more'>докладніше >></a></right>
        </article>
        
        <article>
          <name><a href='#'>Віддалений офіс на роутері MikroTik + PPTP VPN + RDP + 1С</a></name>
          <blogname>додано до: <a href='#'>Налаштування, лайфхаки, корисності</a></blogname>
          <text>
            <img src='/default/img/blog/mikrotik.png' />
            В звязку з тим, що на державному рівні введено карантин по боротьбі з коронавірусом 2019 багато підприємств переходять на віддалену роботу.Працювати віддалено з дому пробують все більше працівників офісів та компаній і оцінюють таку роботу справді зручною.Нам часто задають питання, як своїми силами налаштувати віддалену роботу бухгалтера, менеджера..
          </text>
          <right><a href='#' class='more'>докладніше >></a></right>
        </article>
      </blog>
        
    </content>
  </page>
  
  <footer>
    <grid class='page'>
      <cell>
        <title>Інформація</title>
        <a href='#'>Головна</a>
        <a href='#'>Товари</a>
        <a href='#'>Послуги</a>
        <a href='#'>Обслуговування підприємств</a>
        <a href='#'>Контакти</a>
        <a href='#'>Доставка і оплата</a>
      </cell>
      <cell>
        <title>Служба підтримки</title>
        <a href='#'>Контакти</a>
        <a href='#'>Повернення товару</a>
        <a href='#'>Карта сайту</a>
      </cell>
      <cell>
        <title>Додатково</title>
        <a href='#'>Виробники</a>
        <a href='#'>Подарункові сертифікати</a>
        <a href='#'>Партнерська програма</a>
        <a href='#'>Акції</a>
        <a href='#'>Блог</a>
      </cell>
      <cell>
        <title>Особистий Кабінет</title>
        <a href='#'>Особистий Кабінет</a>
        <a href='#'>Історія замовлень</a>
        <a href='#'>Закладки</a>
        <a href='#'>Розсилка</a>
      </cell>
    </grid>
  </footer>
  
  <call><a href='#' onclick='javascript: alert("Модальне вікно ..."); return false;'><icon class='phone' title='Замовити зворотній дзвінок'></icon></a></call>
  
</body>

</html>